     A          R CODANO
     A            AENVNAM       10A         COLHDG('Environnement')
     A            AOBJCOD        7A         COLHDG('Code objet')
     A          K AOBJCOD
     A          K AENVNAM
