     A                                      UNIQUE
     A          R QUAI
     A            ENVNAM        10          COLHDG('Environnement Quai')
     A          K ENVNAM
