     A          R MEPHST
     A                                      PFILE(MEPHSTPF)
     A          K BLNAME
     A          K MEPDATE
     A          K MEPTIME
     A          K MSGID
